---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.CurveIntersectsCutFace
source: html/51880188-e051-5eb8-cc65-433e52bd3375.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.CurveIntersectsCutFace Property

The highlighted line intersects the boundary of the face being modified. To modify a cut face, use open loops that end on the
 existing boundary without intersecting or overlapping existing edges.

## Syntax (C#)
```csharp
public static FailureDefinitionId CurveIntersectsCutFace { get; }
```